{
    "id": "1993_asmw",
    "name": "Application of sampling methodologies to wide-area network traffic characterization",
    "datePublished": "1993.5",
    "description": "The relative performance of different data collection methods\r\nin the assessment of various traffic parameters is significant when the\r\namount of data generated by a complete trace of a traffic interval is\r\ncomputationally overwhelming, and even capturing summary statistics for\r\nall traffic is impractical. This paper presents a study of the\r\nperformance of various methods of sampling in answering questions\r\nrelated to wide area network traffic characterization. Using a packet\r\ntrace from a network environment that aggregates traffic from a large\r\nnumber of sources, we simulate various sampling approaches, including\r\ntime-driven and event-driven methods, with both random and deterministic\r\nselection patterns, at a variety of granularities. Using several metrics\r\nwhich indicate the similarity between two distributions, we then compare\r\nthe sampled traces to the parent population. Our results revealed that\r\nthe time-triggered techniques did not perform as well as the\r\npacket-triggered ones. Furthermore, the performance differences within\r\neach class (packet-based or time-based techniques) are small.\r\n",
    "tags": [
        "measurement methodology",
        "passive data analysis"
    ],
    "pubdb_id": "paper179",
    "venue": "acm_sigcomm",
    "authors": [
        {
            "person": "person:claffy_kc",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:polyzos_george",
            "organization": [
                "University of California, San Diego (UCSD)"
            ]
        },
        {
            "person": "person:braun_hans-werner",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        }
    ],
    "links": [
        {
            "from": "PubDBlinkId:365",
            "label": "gzipped postscript",
            "to": "asmw.ps.gz"
        },
        {
            "from": "PubDBlinkId:364",
            "label": "PDF",
            "to": "https://www.caida.org/publications/papers/1993/asmw/sigcomm.sampling.pdf"
        }
    ],
    "bibtexFields": {
        "type": "INPROCEEDINGS",
        "booktitle": "ACM SIGCOMM",
        "institution": "",
        "bibtex": "",
        "journal": "",
        "volume": "",
        "number": "",
        "pages": "",
        "linkedObjects": ""
    }
}