{
    "id": "2011_midar-tr",
    "name": "Internet-Scale IPv4 Alias Resolution with MIDAR: System Architecture - Technical Report",
    "datePublished": "2011.5",
    "description": "A critical step in creating accurate Internet topology maps from traceroute data is mapping IP addresses to routers, a process known as alias resolution. Recent work in alias resolution inferred aliases based on similarities in IP ID time series produced by different IP addresses. We design, implement, and experiment with a new tool that builds on these insights to scale to Internet-scale topologies, i.e., millions of addresses, with greater precision and sensitivity. MIDAR, our Monotonic ID-Based Alias Resolution tool, provides an extremely precise ID comparison test based on monotonicity rather than proximity. MIDAR integrates multiple probing methods, multiple vantage points, and a novel sliding-window probe scheduling algorithm to increase scalability to millions of IP addresses. Experiments show that MIDAR's approach is effective at minimizing the false positive rate sufficiently to achieve a high positive predictive value at Internet scale. We provide sample statistics from running MIDAR on over 2 million addresses, and validate these results against available ground truth. Tools such as MIDAR can help preserve longitudinal history of the Internet's topological evolution. ",
    "tags": [
        "measurement methodology",
        "software/tools",
        "topology"
    ],
    "pubdb_id": "paper483",
    "venue": "cooperative_association_for_internet_data_analysis_caida",
    "authors": [
        {
            "person": "person:keys_ken",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:hyun_young",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:luckie_matthew",
            "organization": [
                "University of Waikato"
            ]
        },
        {
            "person": "person:claffy_kc",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        }
    ],
    "links": [
        {
            "from": "PubDBlinkId:751",
            "label": "PDF",
            "to": "https://www.caida.org/publications/papers/2011/midar-tr/midar-tr.pdf"
        }
    ],
    "bibtexFields": {
        "type": "TECHREPORT",
        "booktitle": "",
        "institution": "Cooperative Association for Internet Data Analysis (CAIDA)",
        "bibtex": "",
        "journal": "",
        "volume": "",
        "number": "",
        "pages": "",
        "linkedObjects": ""
    }
}