{
    "id": "2014_inferring_complex_as_relationships",
    "name": "Inferring Complex AS Relationships",
    "datePublished": "2014.11",
    "description": "The traditional approach of modeling relationships between ASes abstracts relationship types into three broad categories: transit, peering, and sibling. More complicated configurations exist, and understanding them may advance our knowledge of Internet economics and improve models of routing. We use BGP, traceroute, and geolocation data to extend CAIDA's AS relationship inference algorithm to infer two types of complex relationships: hybrid relationships, where two ASes have different relationships at different interconnection points, and partial transit relationships, which restrict the scope of a customer relationship to the provider's peers and customers. Using this new algorithm, we find 4.5% of the 90,272 provider-customer relationships observed in March 2014 were complex, including 1,071 hybrid relationships and 2,955 partial-transit relationships. Because most peering relationships are invisible, we believe these numbers are lower bounds. We used feedback from operators, and relationships encoded in BGP communities and RPSL, to validate 20% and 6.9% of our partial transit and hybrid inferences, respectively, and found our inferences have 92.9% and 97.0% positive predictive values. Hybrid relationships are not only established between large transit providers; in 57% of the inferred hybrid transit/peering relationships the customer had a customer cone of fewer than 5 ASes.",
    "tags": [
        "measurement methodology",
        "routing",
        "topology",
        "congestion"
    ],
    "pubdb_id": "paper563",
    "venue": "acm_internet_measurement_conference_imc",
    "authors": [
        {
            "person": "person:giotsas_vasileios",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:luckie_matthew",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:huffaker_bradley",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:claffy_kc",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        }
    ],
    "links": [
        {
            "from": "PubDBlinkId:1531",
            "label": "Data Supplement",
            "to": "http://data.caida.org/datasets/2014-complex-data-supplement/"
        },
        {
            "from": "PubDBlinkId:1533",
            "label": "DOI",
            "to": "http://dx.doi.org/10.1145/2663716.2663743"
        },
        {
            "from": "PubDBlinkId:1532",
            "label": "PDF",
            "to": "https://www.caida.org/publications/papers/2014/inferring_complex_as_relationships/inferring_complex_as_relationships.pdf"
        }
    ],
    "bibtexFields": {
        "type": "INPROCEEDINGS",
        "booktitle": "ACM Internet Measurement Conference (IMC)",
        "institution": "",
        "bibtex": "",
        "journal": "",
        "volume": "",
        "number": "",
        "pages": "23-30",
        "linkedObjects": ""
    }
}