{
    "id": "2014_world_on_ndn",
    "name": "A World on NDN: Affordances & Implications of the Named Data Networking Future Internet Architecture",
    "datePublished": "2014.4",
    "description": "This paper explores the potential social impacts of Named Data Networking (NDN), a proposed future Internet architecture that forwards packets based on data names rather than host addresses. We highlight four departures from today's TCP/IP architecture, which underscore the social impacts of NDN: the architecture's emphases on enabling semantic classification, provenance, publication, and decentralized communication. While all of these principles can be implemented in the current Internet‛s application layer, NDN enables them at the network layer, and thus encourages all applications to comport with them. We describe how these changes from TCP/IP will expand affordances for free speech, and produce positive outcomes for security, privacy and anonymity while raising new challenges regarding data retention and forgetting. We describe how these changes might alter current corporate and law enforcement content regulation mechanisms by changing the way data is identified, handled, and routed across the Web. We examine how even as NDN empowers edges with more decentralized communication options, by providing more context per packet than IP, it raises new challenges in ensuring neutrality across the public network. Finally, we introduce openings where telecommunications policy can evolve alongside NDN to ensure an open, fair Internet. '' This technical report was later published as a paper in December 2016.",
    "tags": [
        "topology",
        "overview"
    ],
    "pubdb_id": "paper572",
    "venue": "named_data_networking_ndn",
    "authors": [
        {
            "person": "person:shilton_katie",
            "organization": [
                "University of Maryland, College Park"
            ]
        },
        {
            "person": "person:burke_jeffrey",
            "organization": [
                "University of California, Los Angeles (UCLA)"
            ]
        },
        {
            "person": "person:claffy_kc",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:duan_charles",
            "organization": [
                "University of Colorado Law School"
            ]
        },
        {
            "person": "person:zhang_lixia",
            "organization": [
                "University of California, Los Angeles (UCLA)"
            ]
        }
    ],
    "links": [
        {
            "from": "PubDBlinkId:1535",
            "label": "PDF",
            "to": "https://www.caida.org/publications/papers/2014/world_on_ndn/world_on_ndn.pdf"
        },
        {
            "from": "PubDBlinkId:1863",
            "label": "Related Paper",
            "to": "https://www.caida.org/publications/papers/2016/anticipating_policy_social_implications_ndn/"
        }
    ],
    "bibtexFields": {
        "type": "TECHREPORT",
        "booktitle": "",
        "institution": "Named Data Networking (NDN)",
        "bibtex": "",
        "journal": "",
        "volume": "",
        "number": "18",
        "pages": "",
        "linkedObjects": ""
    }
}