{
    "id": "2015_comments_cybersecurity_research_development",
    "name": "Comments on Cybersecurity Research and Development Strategic Plan",
    "datePublished": "2015.6",
    "description": "The RFI asks \"What innovative, transformational technologies have the potential to enhance the security, reliability, resiliency, and trustworthiness of the digital infrastructure, and to protect consumer privacy?\"\r\n\r\nWe believe that it would be beneficial to reframe and broaden the scope of this question. The security problems that we face today are not new, and do not persist because of a lack of a technical breakthrough. Rather, they arise in large part in the larger context within which the technology sits, a space defined by misaligned economic incentives that exacerbate coordination problems, lack of clear leadership, regulatory and legal barriers, and the intrinsic complications of a globally connected ecosystem with radically distributed ownership of constituent parts of the infrastructure. Worse, although the public and private sectors have both made enormous investments in cybersecurity technologies over the last decade, we lack relevant data that can characterize the nature and extent of specific cybersecurity problems, or assess the effectiveness of technological or other measures intended to address them.\r\n\r\nWe first examine two inherently disconnected views of cybersecurity, the correct-operation view and the harm view. These two views do not always align. Attacks on specific components, while disrupting correct operation, may not map to a specific and quantifiable harm. Classes of harms do not always derive from a specific attack on a component; there may be many stages of attack activity that result in harm. Technologists tend to think about assuring correct operation while users, businesses, and policy makers tend to think about preventing classes of harms. Discussions of public policy including research and development funding strategies must bridge this gap.\r\n\r\nWe then provide two case studies to illustrate our point, and emphasize the importance of developing ways to measure the return on federal investment in cybersecurity R&D.'' Comment in response to Request for Information (RFI)-Federal Cybersecurity R&D Strategic Plan, posted by the National Science Foundation on 4/27/2015. This comment reflects our views and not necessarily those of the agencies sponsoring our research.",
    "tags": [
        "economics",
        "policy"
    ],
    "pubdb_id": "paper584",
    "venue": "networking_and_information_technology_research_and_development_nitrd_program",
    "authors": [
        {
            "person": "person:clark_david",
            "organization": [
                "Massachusetts Institute of Technology's Computer Science & Artificial Intelligence Laboratory (MIT/CSAIL)"
            ]
        },
        {
            "person": "person:claffy_kc",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        }
    ],
    "links": [
        {
            "from": "PubDBlinkId:1620",
            "label": "Original FCC Document",
            "to": "https://www.federalregister.gov/articles/2015/04/27/2015-09697/request-for-information-rfi-federal-cybersecurity-randd-strategic-plan"
        },
        {
            "from": "PubDBlinkId:1619",
            "label": "PDF",
            "to": "https://www.caida.org/publications/papers/2015/comments_cybersecurity_research_development/comments_cybersecurity_research_development.pdf"
        },
        {
            "from": "PubDBlinkId:1628",
            "label": "Related RFIs",
            "to": " https://www.nitrd.gov/cybersecurity/"
        }
    ],
    "bibtexFields": {
        "type": "ARTICLE",
        "booktitle": "",
        "institution": "",
        "bibtex": "",
        "journal": "Networking and Information Technology Research and Development (NITRD) Program",
        "volume": "",
        "number": "",
        "pages": "",
        "linkedObjects": ""
    }
}