{
    "id": "2016_att_ime_justification",
    "name": "Report of AT&T Independent Measurement Expert Background and supporting arguments for measurement and reporting requirements",
    "datePublished": "2016.8",
    "description": "This document is a companion to the document titled “Report of AT&T Independent Measurement Expert: Reporting requirements and measurement methods”, which is the set of requirements specified by the Independent Measurement Expert in the matter of the Memorandum Opinion and Order for the merger of AT&T and DirecTV. In this document, we elaborate on the reasoning and motivation behind the measurement methodology we have specified. A paragraph from the merger order provides context for our task:\r\n\r\n> Discussion. As stated in the 2015 Open Internet Order, “consumers bear the harm when they experience degraded access to the applications and services of their choosing due to a dispute between a large broadband provider and an interconnecting party.” Also, because OVD subscribers expect high-quality video, OVDs are vulnerable to degradation at the interconnection point with a broadband Internet access service provider’s last mile network. Thus, as stated in the 2015 Open Internet Order, we find that “broadband Internet access providers have the ability to use terms of interconnection to disadvantage edge providers and that consumers’ ability to respond to unjust or unreasonable broadband provider practices are limited by switching costs.” We appreciate commenters’ concerns in this area.'' Acting as an independent contractor, CAIDA will conduct measurements and assessments of performance characteristics of traffic exchanged at AT&T Internet Interconnection Points located within the United States. ",
    "tags": [
        "measurement methodology",
        "policy",
        "data"
    ],
    "pubdb_id": "paper618",
    "venue": "federal_communications_commission_fcc",
    "authors": [
        {
            "person": "person:claffy_kc",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:dhamdhere_amogh",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:clark_david",
            "organization": [
                "Massachusetts Institute of Technology's Computer Science & Artificial Intelligence Laboratory (MIT/CSAIL)"
            ]
        },
        {
            "person": "person:bauer_steven",
            "organization": [
                "Massachusetts Institute of Technology's Computer Science & Artificial Intelligence Laboratory (MIT/CSAIL)"
            ]
        }
    ],
    "links": [
        {
            "from": "PubDBlinkId:1803",
            "label": "PDF",
            "to": "https://www.caida.org/publications/papers/2016/att_ime_justification/att_ime_justification.pdf"
        },
        {
            "from": "PubDBlinkId:1804",
            "label": "Project page",
            "to": "https://www.caida.org/funding/att-interconnection/"
        },
        {
            "from": "PubDBlinkId:1805",
            "label": "Related Report",
            "to": "https://www.caida.org/publications/papers/2016/att_ime_first_amended_report"
        }
    ],
    "bibtexFields": {
        "type": "MISC",
        "booktitle": "",
        "institution": "Federal Communications Commission (FCC)",
        "bibtex": "",
        "journal": "",
        "volume": "",
        "number": "",
        "pages": "",
        "linkedObjects": ""
    }
}