{
    "id": "2016_characterizing_ipv6_control",
    "name": "Characterizing IPv6 control and data plane stability",
    "datePublished": "2016.4",
    "description": "End-to-end IPv6 performance is a factor that can influence IPv6 adoption. The stability of IPv6 – both in the control and data plane – is an important determinant of end-to-end performance, as it influences packet loss, network latency, and hence application performance. In this paper we compare stability and performance measurements from the control and data plane in IPv6 and IPv4. To study control plane stability, we use BGP feeds from five dual-stacked vantage points to measure routing dynamics towards IPv4 and IPv6 destinations. To study data plane stability, we probe dual-stacked webservers in 629 target ASes to determine the availability, RTT performance and RTT stability of paths toward these targets. In both control and data plane experiments IPv6 exhibited less stability than IPv4. In the control plane, most routing dynamics were generated by a small fraction of pathological unstable prefixes. In the data-plane, episodes of unavailability were longer on IPv6 than on IPv4. We found evidence of correlated performance degradation over IPv4 and IPv6 caused by shared infrastructure.",
    "tags": [
        "ipv6",
        "internet id consumption",
        "routing",
        "congestion"
    ],
    "pubdb_id": "paper604",
    "venue": "ieee_conference_on_computer_communications_infocom",
    "authors": [
        {
            "person": "person:livadariu_ioana",
            "organization": [
                "Simula Research Laboratory"
            ]
        },
        {
            "person": "person:elmokashfi_ahmed",
            "organization": [
                "Simula Research Laboratory"
            ]
        },
        {
            "person": "person:dhamdhere_amogh",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        }
    ],
    "links": [
        {
            "from": "PubDBlinkId:2134",
            "label": "DOI",
            "to": "https://doi.org/10.1109/INFOCOM.2016.7524465"
        },
        {
            "from": "PubDBlinkId:1745",
            "label": "PDF",
            "to": "https://www.caida.org/publications/papers/2016/characterizing_ipv6_control/characterizing_ipv6_control.pdf"
        },
        {
            "from": "PubDBlinkId:1746",
            "label": "Related Presentation",
            "to": "https://www.caida.org/publications/presentations/2016/characterizing_ipv6_control_infocom/"
        }
    ],
    "bibtexFields": {
        "type": "INPROCEEDINGS",
        "booktitle": "IEEE Conference on Computer Communications (INFOCOM)",
        "institution": "",
        "bibtex": "",
        "journal": "",
        "volume": "",
        "number": "",
        "pages": "",
        "linkedObjects": ""
    }
}