{
    "id": "2017_using_loops_observed_traceroute",
    "name": "Using Loops Observed in Traceroute to Infer the Ability to Spoof",
    "datePublished": "2017.3",
    "description": "Despite source IP address spoofing being a known vulnerability for at least 25 years, and despite many efforts to shed light on the problem, spoofing remains a popular attack method for redirection, amplification, and anonymity. To defeat these attacks requires operators to ensure their networks filter packets with spoofed source IP addresses, known as source address validation (SAV), best deployed at the edge of the network where traffic originates. In this paper, we present a new method using routing loops appearing in traceroute data to infer inadequate SAV at the transit provider edge, where a provider does not filter traffic that should not have come from the customer. Our method does not require a vantage point within the customer network. We present and validate an algorithm that identifies at Internet scale which loops imply a lack of ingress filtering by providers. We found 703 provider ASes that do not implement ingress filtering on at least one of their links for 1,780 customer ASes. Most of these observations are unique compared to the existing methods of the Spoofer and Open Resolver projects. By increasing the visibility of the networks that allow spoofing, we aim to strengthen the incentives for the adoption of SAV.",
    "tags": [
        "active data analysis",
        "routing",
        "security",
        "topology"
    ],
    "pubdb_id": "paper626",
    "venue": "passive_and_active_measurement_conference_pam",
    "authors": [
        {
            "person": "person:lone_qasim",
            "organization": [
                "Delft University of Technology, the Netherlands"
            ]
        },
        {
            "person": "person:luckie_matthew",
            "organization": [
                "University of Waikato"
            ]
        },
        {
            "person": "person:korczyński_maciej",
            "organization": [
                "Delft University of Technology, the Netherlands"
            ]
        },
        {
            "person": "person:van eeten_michel",
            "organization": [
                "Delft University of Technology, the Netherlands"
            ]
        }
    ],
    "links": [
        {
            "from": "PubDBlinkId:2004",
            "label": "DOI",
            "to": "http://dx.doi.org/10.1007/978-3-319-54328-4_17"
        },
        {
            "from": "PubDBlinkId:1858",
            "label": "PDF",
            "to": "https://www.caida.org/publications/papers/2017/using_loops_observed_traceroute/using_loops_observed_traceroute.pdf"
        }
    ],
    "bibtexFields": {
        "type": "INPROCEEDINGS",
        "booktitle": "Passive and Active Measurement Conference (PAM)",
        "institution": "",
        "bibtex": "",
        "journal": "",
        "volume": "",
        "number": "",
        "pages": "",
        "linkedObjects": ""
    }
}