{
    "id": "2020_flowtrace",
    "name": "FlowTrace: A Framework for Active Bandwidth Measurements using In-band Packet Trains",
    "datePublished": "2020.3",
    "description": "Active measurement tools are important to understand and diagnose performance bottlenecks on the Internet. However, their overhead is a concern because a high number of additional measurement packets can congest the network they try to measure. To address this issue, prior work has proposed in-band approaches that piggyback application traffic for active measurements. However, prior approaches are hard to deploy because they require either specialized hardware or modifications in the Linux kernel. In this paper, we propose FlowTrace–a readily deployable user-space active measurement framework that leverages application TCP flows to carry out in-band network measurements. Our implementation of Pathneck using FlowTrace creates recursive packet trains to locate bandwidth bottlenecks. The experimental evaluation on a testbed shows that FlowTrace is able to locate bandwidth bottlenecks as accurately as Pathneck with significantly less overhead.",
    "tags": [
        "measurement methodology",
        "QoE",
        "routing"
    ],
    "pubdb_id": "paper698",
    "venue": "passive_and_active_measurement_conference_pam",
    "authors": [
        {
            "person": "person:ahmed_adnan",
            "organization": [
                "University of Iowa"
            ]
        },
        {
            "person": "person:mok_ricky k. p.",
            "organization": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:shafiq_zubair",
            "organization": [
                "University of Iowa"
            ]
        }
    ],
    "links": [
        {
            "from": "PubDBlinkId:2249",
            "label": "DOI",
            "to": "https://doi.org/10.1007/978-3-030-44081-7_3"
        },
        {
            "from": "PubDBlinkId:2248",
            "label": "PDF",
            "to": "https://www.caida.org/publications/papers/2020/flowtrace/flowtrace.pdf"
        },
        {
            "from": "PubDBlinkId:2256",
            "label": "Related Presentation",
            "to": "https://www.caida.org/publications/presentations/2020/flowtrace_pam/"
        }
    ],
    "bibtexFields": {
        "type": "INPROCEEDINGS",
        "booktitle": "Passive and Active Measurement Conference (PAM)",
        "institution": "",
        "bibtex": "",
        "journal": "",
        "volume": "",
        "number": "",
        "pages": "",
        "linkedObjects": ""
    }
}